{
    "metrics": {
        "total_rows": 4722,
        "columns": 6,
        "completeness": 100.0,
        "freshness": "N/A",
        "duplicate_rows": 0
    },
    "summary": "**Business-Friendly Summary:**\nThis dataset, 'order_items', contains information about individual items ordered by customers. Each row represents a single item in an order, with columns providing details on the order ID, product ID, quantity, list price, and discount applied to each item.\n\n**Use Case:**\nA business would analyze this data to gain insights into customer purchasing behavior, such as identifying top-selling products, analyzing pricing and promotion effectiveness, and optimizing inventory management. By examining trends in orders and discounts, a company can refine its marketing strategies, adjust product offerings, and ultimately improve revenue and customer satisfaction.",
    "schema_explanation": "Here's an explanation of the technical schema of the 'order_items' table:\n\nThe 'order_items' table is used to store information about individual items that are part of an order. Think of it like a receipt for your online shopping cart. Each row in this table represents one item you ordered, and its corresponding details.\n\nLet's break down each column:\n\n* **Order_id**: This column links each order item back to the main 'orders' table, which stores information about the entire order (like the customer's name, order date, etc.). Think of it like a unique identifier that says \"this item belongs to this specific order\".\n* **Item_id**: This is another identifier for the same item. It's like a serial number that helps track the item across different orders or tables.\n* **Product_id**: This column links each item back to the 'products' table, which stores information about the product itself (like its name, description, price, etc.). Think of it like saying \"this item is actually this specific product\".\n* **Quantity**: This tells you how many units of that product were ordered. For example, if you ordered 2 t-shirts, this column would say \"quantity = 2\".\n* **List_price**: This is the original price of the product before any discounts or promotions. Think of it like the sticker price.\n* **Discount**: If there was a discount applied to this item, this column shows how much that discount reduced the price.\n\nIn summary, the 'order_items' table stores detailed information about each individual item in an order, linking back to both the main order and the product itself. This allows you to easily look up details like quantity, original price, and any discounts applied.",
    "raw_schema": {
        "order_id": "int64",
        "item_id": "int64",
        "product_id": "int64",
        "quantity": "int64",
        "list_price": "float64",
        "discount": "float64"
    }
}