{
    "metrics": {
        "total_rows": 4722,
        "columns": 6,
        "completeness": 100.0,
        "freshness": "N/A",
        "duplicate_rows": 0
    },
    "summary": "**Business Friendly Summary:**\nThe 'order_items' table/view represents individual items ordered by customers, containing details such as the order ID, item ID, product ID, quantity, list price, and discount applied to each item. This data provides insights into customer purchasing behavior and product demand.\n\n**Use Case:**\nA business would analyze this data to understand how products are performing across different orders, including best-selling items, most profitable products, and potential areas for improvement (e.g., identifying over-discounted or under-discounted products). By analyzing the 'order_items' table/view, a business can inform product pricing strategies, optimize inventory management, and make data-driven decisions to drive revenue growth.",
    "schema_explanation": "Let's break down the technical schema of the \"order_items\" table/view into simpler language.\n\nThe \"order_items\" table is like an inventory management system, where we store information about each item sold or ordered by customers. Think of it like a cataloging system for your favorite online shopping website!\n\nHere are the columns and what they mean:\n\n* **Order_id**: This is a unique identifier for each order (think of it as a receipt number). It's an integer value that links to other information about the same order.\n* **Item_id**: This is another unique identifier, this time for each item in the order. Think of it like a product code or SKU (Stock Keeping Unit).\n* **Product_id**: This column links back to more general information about the product itself (e.g., what type of product it is, its description, etc.). It's an integer value that connects to other data about the same product.\n* **Quantity**: This tells us how many items were ordered or sold. It's also an integer value, which makes sense since you can't have a fraction of an item!\n* **List_price**: This is the original price of the item before any discounts were applied. It's a floating-point number (which means it has decimal points) because prices often involve cents.\n* **Discount**: This shows how much discount was given for each item. Again, it's a floating-point number.\n\nNow, let's talk about relationships between columns:\n\n* The **Order_id** and **Item_id** columns together create a unique combination that identifies a specific order and its corresponding items. Think of it like a receipt that lists all the items in an order.\n* The **Product_id** column links back to general information about each product, which would be stored in another table or database.\n\nPotential use cases for this schema include:\n\n1. E-commerce websites: This schema could be used to track orders and their corresponding items, allowing for easy management of inventory and customer data.\n2. Point-of-Sale (POS) systems: The \"order_items\" table could be used to record sales transactions at a store or restaurant, making it easier to track what was sold and when.\n3. Inventory management: By linking the \"order_items\" table to another table with product information, you can get insights into which products are most popular or need restocking.\n\nIn summary, the \"order_items\" schema is designed to keep track of orders and their corresponding items, allowing for easy analysis and management of data.",
    "raw_schema": {
        "order_id": "int64",
        "item_id": "int64",
        "product_id": "int64",
        "quantity": "int64",
        "list_price": "float64",
        "discount": "float64"
    },
    "data_preview": "|   order_id |   item_id |   product_id |   quantity |   list_price |   discount |\n|-----------:|----------:|-------------:|-----------:|-------------:|-----------:|\n|          1 |         1 |           20 |          1 |       599.99 |       0.2  |\n|          1 |         2 |            8 |          2 |      1799.99 |       0.07 |\n|          1 |         3 |           10 |          2 |      1549    |       0.05 |\n|          1 |         4 |           16 |          2 |       599.99 |       0.05 |\n|          1 |         5 |            4 |          1 |      2899.99 |       0.2  |"
}